Core/src/Documents/УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ/УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОбОтгрузкеГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГИСМ</name>
    <type>
      <types>DefinedType.НомерДокументаГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборотаТовара</name>
    <type>
      <types>EnumRef.ВидОборотаТовараГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GLNКонтрагента</name>
    <type>
      <types>DefinedType.GLN</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентНеЗарегистрированВГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТаможенногоОргана</name>
    <type>
      <types>DefinedType.КодТаможенногоОрганаГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДекларации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерДекларации</name>
    <type>
      <types>DefinedType.РегистрационныйНомерДекларацииГИСМ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераКиЗ</name>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDTID</name>
      <type>
        <types>DefinedType.RFIDTID</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDEPC</name>
      <type>
        <types>DefinedType.RFIDEPC</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подтверждено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодтверждения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ/СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ</name>
  <resources>
    <name>ТекущееУведомлениеОбОтгрузке</name>
    <type>
      <types>DocumentRef.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентПодтвержденныхКиЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОбОтгрузкеГИСМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидОборотаТовараГИСМ/ВидОборотаТовараГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОборотаТовараГИСМ</name>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортВСтраныЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортЗаПределыЕАЭС</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ/СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>КПередаче</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ПринятоВОбработкуГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоКлиентом</name>
  </enumValues>
  <enumValues>
    <name>ОбрабатываетсяПоступление</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнтеграцияГИСМПереопределяемый.ОбработкаЗаполненияУведомленияОбОтгрузкеГИСМ(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	GLNКонтрагента = ИнтеграцияГИСМ.ПоследнийУказанныйВДокументахGLNКонтрагента(Контрагент);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	РеквизитыКонтрагента = ИнтеграцияГИСМВызовСервера.РеквизитыКонтрагента(Контрагент);
	
	ЭтоВозвратФизическомуЛицуПоКомиссии = ИнтеграцияГИСМ.ДокументОснованиеВозвратПоставщику(Основание)
		И РеквизитыКонтрагента.ЭтоФизическоеЛицо
		И ВидОборотаТовара = Перечисления.ВидОборотаТовараГИСМ.Комиссия;
	
	ЭтоЭкспортЗаПределыЕАЭС = (ВидОборотаТовара = Перечисления.ВидОборотаТовараГИСМ.ЭкспортЗаПределыЕАЭС);
	ЭкспортВСтраныЕАЭС      = (ВидОборотаТовара = Перечисления.ВидОборотаТовараГИСМ.ЭкспортВСтраныЕАЭС);
	
	Если Не ЭтоЭкспортЗаПределыЕАЭС Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КодТаможенногоОргана");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаРегистрацииДекларации");
		МассивНепроверяемыхРеквизитов.Добавить("РегистрационныйНомерДекларации");
	КонецЕсли;
	
	Если ЭтоЭкспортЗаПределыЕАЭС Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
	КонецЕсли;
	
	Если    ЭтоЭкспортЗаПределыЕАЭС
		Или ЭкспортВСтраныЕАЭС
		Или КонтрагентНеЗарегистрированВГИСМ
		Или ЭтоВозвратФизическомуЛицуПоКомиссии Тогда
		МассивНепроверяемыхРеквизитов.Добавить("GLNКонтрагента");
	КонецЕсли;
	
	Если ЭтоНовый() И ЗначениеЗаполнено(Основание) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.ТекущееУведомлениеОбОтгрузке
		|ИЗ
		|	РегистрСведений.СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ КАК СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ
		|ГДЕ
		|	СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.Документ = &Основание
		|	И НЕ СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.Статус В (
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.ОтклоненоКлиентом),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.ОтклоненоГИСМ),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.Отсутствует)
		|		)
		|	И НЕ СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ.ТекущееУведомлениеОбОтгрузке = ЗНАЧЕНИЕ(Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Основание", Основание);
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ТекстОшибки = НСтр("ka='დოკუმენტ %1-ისთვის უკვე არსებობს მიმდინარე %2.';ru='Для документа %1 уже существует текущая %2.'");
				ТекстОшибки =  СтрШаблон(ТекстОшибки, Основание, Выборка.ТекущееУведомлениеОбОтгрузке);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					,
					,
					Отказ);
			
				КонецЕсли;
				
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НомераКиЗ.Очистить();
	
	НомерГИСМ = 0;
	Основание = Неопределено;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ЗаписьНового", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
